STMicroelectronics/STM32CubeWB0/Projects/NUCLEO-WB07CC/Applications/BLE/BLE_SerialCom_Peripheral/STM32_BLE/App/app_ble.c
          APP_DBG_MSG(">>== ACI_L2CAP_COS_CONNECTION_REQ_VSEVT_CODE\n");
          APP_DBG_MSG("Channel_Type: %d\nSPSM: 0x%04X\nPeer_MTU: %d\nPeer_MPS: %d\nCID_Count: %d\n", p_l2cap_cos_connection->Channel_Type, 
                                                                                                                        p_l2cap_cos_connection->SPSM, 
                                                                                                                        p_l2cap_cos_connection->Peer_MTU, 
                                                                                                                        p_l2cap_cos_connection->Peer_MPS,
                                                                                                                        p_l2cap_cos_connection->CID_Count);
          
          if(p_l2cap_cos_connection->CID_Count > 1)
          {
            result = L2CAP_CONN_FAIL_INSUFFICIENT_RESOURCES;
          }
          if(p_l2cap_cos_connection->Channel_Type == L2CAP_CHANNEL_TYPE_LE_CFC)
          {
            ret = aci_l2cap_cos_connection_resp(p_l2cap_cos_connection->Connection_Handle,
                                                p_l2cap_cos_connection->Identifier,
                                                MAX_SDU_SIZE,
                                                64,
                                                result,
                                                1,
                                                &BleCoCContextPeriph.Channel_ID);
            if(ret != BLE_STATUS_SUCCESS)
            {
              APP_DBG_MSG("==>> aci_l2cap_cos_connection_resp : Fail, reason: 0x%02X\n", ret);
            } 
            else 
            {
              APP_DBG_MSG("==>> aci_l2cap_cos_connection_resp : Success\n");
            }
          }
          else
          {
            APP_DBG_MSG("Invalid event type\n");
            return;
          }
          
          BleCoCContextPeriph.Conn_Handle = p_l2cap_cos_connection->Connection_Handle;
          BleCoCContextPeriph.Peer_Max_Transmission_Unit = p_l2cap_cos_connection->Peer_MTU;
          BleCoCContextPeriph.SPSM = p_l2cap_cos_connection->SPSM;  
          
          HandleNotification.CoC_Evt_Opcode = EXCHANGE_ATT_MTU;
          HandleNotification.ConnectionHandle = BleCoCContextPeriph.Conn_Handle;
          COC_PERIPH_APP_Notification(&HandleNotification);
        }
        break;
        
      case ACI_L2CAP_COS_SDU_DATA_RX_VSEVT_CODE:
        {
          aci_l2cap_cos_sdu_data_tx_event_rp0 *p_l2cap_sdu_data_tx_resp;
          p_l2cap_sdu_data_tx_resp = (aci_l2cap_cos_sdu_data_tx_event_rp0 *) p_blecore_evt->data;
 
          tBleStatus ret;
          
          HandleNotification.CoC_Evt_Opcode = L2CAP_DATA_RECEIVED;
          HandleNotification.ConnectionHandle = bleAppContext.BleApplicationContext_legacy.connectionHandle;
          HandleNotification.DataLength = p_l2cap_sdu_data_tx_resp->SDU_Length;
          
          ret = aci_l2cap_cos_sdu_data_extract(p_l2cap_sdu_data_tx_resp->Connection_Handle, 
                                           p_l2cap_sdu_data_tx_resp->CID, 
                                           MAX_SDU_SIZE,
                                           HandleNotification.DataTable,
                                           &HandleNotification.DataLength);
          
          if(ret != BLE_STATUS_SUCCESS)
          {
            APP_DBG_MSG("aci_l2cap_cos_sdu_data_extract: fail, reason: 0x%02X\n", ret);
            return;
          }
          
          /* periph */
          COC_PERIPH_APP_Notification(&HandleNotification);
        }
        break;        
        /* USER CODE END EVT_VENDOR_1 */
      default:
        /* USER CODE BEGIN EVT_VENDOR_DEFAULT */
        
        /* USER CODE END EVT_VENDOR_DEFAULT */
        break;
      }
    } /* HCI_VENDOR_EVT_CODE */
    break;

  case HCI_HARDWARE_ERROR_EVT_CODE:
    {
      hci_hardware_error_event_rp0 *p_hci_hardware_error_event;
      p_hci_hardware_error_event = (hci_hardware_error_event_rp0*)p_event_pckt->data;

      if (p_hci_hardware_error_event->Hardware_Code <= 0x03)
      {
        NVIC_SystemReset();
      }
    }
    break;

    /* USER CODE BEGIN EVENT_PCKT */
    
    /* USER CODE END EVENT_PCKT */

  default:
    /* USER CODE BEGIN ECODE_DEFAULT*/
    
    /* USER CODE END ECODE_DEFAULT*/
    break;
  }
}

static void connection_complete_event(uint8_t Status,
                                      uint16_t Connection_Handle,
                                      uint8_t Peer_Address_Type,
                                      uint8_t Peer_Address[6],
                                      uint16_t Connection_Interval,
                                      uint16_t Peripheral_Latency,
                                      uint16_t Supervision_Timeout)
{
  /* USER CODE BEGIN HCI_EVT_LE_CONN_COMPLETE_1 */

  /* USER CODE END HCI_EVT_LE_CONN_COMPLETE_1 */
  APP_DBG_MSG(">>== hci_le_connection_complete_event - Connection handle: 0x%04X\n", Connection_Handle);
  APP_DBG_MSG("     - Connection established with @:%02x:%02x:%02x:%02x:%02x:%02x\n",
              Peer_Address[5],
              Peer_Address[4],
              Peer_Address[3],
              Peer_Address[2],
              Peer_Address[1],
              Peer_Address[0]);
  APP_DBG_MSG("     - Connection Interval:   %d.%02d ms\n     - Connection latency:    %d\n     - Supervision Timeout: %d ms\n",
              INT(Connection_Interval*1.25),
              FRACTIONAL_2DIGITS(Connection_Interval*1.25),
              Peripheral_Latency,
              Supervision_Timeout * 10
              );

  if (bleAppContext.Device_Connection_Status == APP_BLE_LP_CONNECTING)
  {
    /* Connection as client */
    bleAppContext.Device_Connection_Status = APP_BLE_CONNECTED_CLIENT;
  }
  else
  {
    /* Connection as server */
    bleAppContext.Device_Connection_Status = APP_BLE_CONNECTED_SERVER;
  }
  bleAppContext.BleApplicationContext_legacy.connectionHandle = Connection_Handle;

  /* USER CODE BEGIN HCI_EVT_LE_CONN_COMPLETE */
  HandleNotification.ConnectionHandle = Connection_Handle;
   
  /* Connection as periph */
  HandleNotification.CoC_Evt_Opcode = BLE_CONN_HANDLE_EVT;
  
  COC_PERIPH_APP_Notification(&HandleNotification);
  
  /* USER CODE END HCI_EVT_LE_CONN_COMPLETE */
}/* end hci_le_connection_complete_event() */

