STMicroelectronics/STM32CubeWB0/Projects/NUCLEO-WB07CC/Applications/BLE/BLE_SerialCom_Peripheral/STM32_BLE/App/app_ble.c
  /* Enable advertising */
  ret = aci_gap_set_advertising_enable(ENABLE, 1, &Advertising_Set_Parameters);
  if (ret != BLE_STATUS_SUCCESS)
  {
      APP_DBG_MSG("==>> Start Fast Advertising Failed , result: 0x%02X\n", ret);
  }
  else
  {
      APP_DBG_MSG("==>> Success: Start Fast Advertising\n");
  }
  
  BLEStack_Process_Schedule();  
  return;
}

void BLE_SVC_L2CAP_Conn_Update(uint16_t ConnectionHandle, uint16_t conn1, uint16_t conn2)
{
  tBleStatus ret;

  ret = aci_l2cap_connection_parameter_update_req(ConnectionHandle,
                                                  conn1, conn2,
                                                  0, 0x3E8);
  if (ret != BLE_STATUS_SUCCESS)
  {
    APP_DBG_MSG("BLE_SVC_L2CAP_Conn_Update(), Failed: 0x%02X\n", ret);
  }
  else
  {
    APP_DBG_MSG("BLE_SVC_L2CAP_Conn_Update(), Successfully\n");
  }

  BLEStack_Process_Schedule();
  return;
}
static void Connection_Interval_Update_Req(void)
{
  if (bleAppContext.Device_Connection_Status != APP_BLE_IDLE)
  {
    BLE_SVC_L2CAP_Conn_Update(bleAppContext.BleApplicationContext_legacy.connectionHandle, 
                              CONN_INT_MS(45), CONN_INT_MS(45));
  }
  BLEStack_Process_Schedule();
  return;
}


static void Periph_security_request(void)
{
  tBleStatus status;
  status = aci_gap_set_security(bleAppContext.BleApplicationContext_legacy.connectionHandle,
                                GAP_SECURITY_LEVEL_3, 0);
  if (status != BLE_STATUS_SUCCESS)
  {
    APP_DBG_MSG("Periph security request cmd failure: 0x%02X\n", status);
  }
  else
  {
    APP_DBG_MSG("Periph security request cmd success\n");
  }
  BLEStack_Process_Schedule();
}

/* USER CODE END FD_LOCAL_FUNCTION */

/* USER CODE BEGIN FD_WRAP_FUNCTIONS */
#if (CFG_BUTTON_SUPPORTED == 1)
void APPE_Button1Action(void)
{    
  
  return;
}

void APPE_Button2Action(void)
{
  tBleStatus ret = BLE_STATUS_INVALID_PARAMS;
  
  if (bleAppContext.Device_Connection_Status != APP_BLE_CONNECTED_SERVER)
  {
    ret = aci_gap_clear_security_db();
    if (ret != BLE_STATUS_SUCCESS)
    {
      APP_DBG_MSG("==>> aci_gap_clear_security_db - Fail, result: 0x%02X\n", ret);
    }
    else
    {
      APP_DBG_MSG("==>> aci_gap_clear_security_db - Success\n");
    }
  }
  else
  {
    APP_DBG_MSG("**PERIPH SECURITY REQ \n");
    UTIL_SEQ_SetTask(1 << CFG_TASK_PERIPH_SECURITY_REQ_ID, CFG_SEQ_PRIO_0);
  }

  return;
}

void APPE_Button3Action(void)
{

  return;
}

#endif /* (CFG_BUTTON_SUPPORTED == 1) */
/* USER CODE END FD_WRAP_FUNCTIONS */

/** \endcond
 */
